In [3]:
"""group by"""
import pandas as pd

In [2]:
marks_data = {
    "Name" : ['lavanya','jaanu','lakshith','dakshith','rio'],
    "Grade":['A','A','B','C','B'],
    "Test Score":[80,82,75,64,72]
}

df = pd.DataFrame(data=marks_data)
df

       Name Grade  Test Score
0   lavanya     A          80
1     jaanu     A          82
2  lakshith     B          75
3  dakshith     C          64
4       rio     B          72

In [16]:
grade_grp = df.groupby(by='Grade')
print(grade_grp)

<pandas.core.groupby.generic.DataFrameGroupBy object at 0x00000126E5AFFB60>

In [27]:
grade_grp.get_group('A')

      Name Grade  Test Score
0  lavanya     A          80
1    jaanu     A          82

In [28]:
grade_grp.get_group('B')

       Name Grade  Test Score
2  lakshith     B          75
4       rio     B          72

In [29]:
grade_grp.get_group('C')

       Name Grade  Test Score
3  dakshith     C          64

In [17]:
for i,j in grade_grp:
    print(i)
    print(j)
    print('-------------------------------------------------')

A
      Name Grade  Test Score
0  lavanya     A          80
1    jaanu     A          82
-------------------------------------------------
B
       Name Grade  Test Score
2  lakshith     B          75
4       rio     B          72
-------------------------------------------------
C
       Name Grade  Test Score
3  dakshith     C          64
-------------------------------------------------

In [19]:
grade_grp['Test Score'].sum()

Grade
A    162
B    147
C     64
Name: Test Score, dtype: int64

In [20]:
grade_grp['Test Score'].max()

Grade
A    82
B    75
C    64
Name: Test Score, dtype: int64

In [21]:
grade_grp['Test Score'].min()

Grade
A    80
B    72
C    64
Name: Test Score, dtype: int64

In [23]:
grade_grp['Test Score'].median()

Grade
A    81.0
B    73.5
C    64.0
Name: Test Score, dtype: float64

In [24]:
grade_grp['Test Score'].mean()

Grade
A    81.0
B    73.5
C    64.0
Name: Test Score, dtype: float64

In [26]:
grade_grp['Name'].count()

Grade
A    2
B    2
C    1
Name: Name, dtype: int64

In [9]:
marks_data = {
    "Name" : ['zoya','lavanya','anny','jaanu','lakshith','shalini','dakshith','rio','chottu'],
    "Grade":['B','A','A','A','B','B','C','B','A'],
    "Subject":['tamil','tamil','maths','maths','tamil','maths','science','maths','tamil'],
    "Test Score":[75,80,88,82,75,77,64,72,89]
}

df2 = pd.DataFrame(data=marks_data)
df2

       Name Grade  Subject  Test Score
0      zoya     B    tamil          75
1   lavanya     A    tamil          80
2      anny     A    maths          88
3     jaanu     A    maths          82
4  lakshith     B    tamil          75
5   shalini     B    maths          77
6  dakshith     C  science          64
7       rio     B    maths          72
8    chottu     A    tamil          89

In [10]:
group2 = df2.groupby(by=["Grade","Subject"])
group2

In [11]:
for i,j in group2:
    print(i)
    print(j)
    print('--------------------------------------')

('A', 'maths')
    Name Grade Subject  Test Score
2   anny     A   maths          88
3  jaanu     A   maths          82
--------------------------------------
('A', 'tamil')
      Name Grade Subject  Test Score
1  lavanya     A   tamil          80
8   chottu     A   tamil          89
--------------------------------------
('B', 'maths')
      Name Grade Subject  Test Score
5  shalini     B   maths          77
7      rio     B   maths          72
--------------------------------------
('B', 'tamil')
       Name Grade Subject  Test Score
0      zoya     B   tamil          75
4  lakshith     B   tamil          75
--------------------------------------
('C', 'science')
       Name Grade  Subject  Test Score
6  dakshith     C  science          64
--------------------------------------

In [12]:
group2.get_group(('A','maths'))

    Name Grade Subject  Test Score
2   anny     A   maths          88
3  jaanu     A   maths          82

In [17]:
group2.get_group(('A','tamil'))

      Name Grade Subject  Test Score
1  lavanya     A   tamil          80
8   chottu     A   tamil          89

In [18]:
group2.get_group(('B','maths'))

      Name Grade Subject  Test Score
5  shalini     B   maths          77
7      rio     B   maths          72

In [19]:
group2.get_group(('B','tamil'))

       Name Grade Subject  Test Score
0      zoya     B   tamil          75
4  lakshith     B   tamil          75

In [20]:
group2.get_group(('C','science'))

       Name Grade  Subject  Test Score
6  dakshith     C  science          64

In [13]:
group2['Test Score'].sum()

Grade  Subject
A      maths      170
       tamil      169
B      maths      149
       tamil      150
C      science     64
Name: Test Score, dtype: int64

In [22]:
group2['Test Score'].max()

Grade  Subject
A      maths      85.0
       tamil      84.5
B      maths      74.5
       tamil      75.0
C      science    64.0
Name: Test Score, dtype: float64

In [23]:
group2['Test Score'].min()

Grade  Subject
A      maths      82
       tamil      80
B      maths      72
       tamil      75
C      science    64
Name: Test Score, dtype: int64

In [21]:
group2['Test Score'].median()

Grade  Subject
A      maths      85.0
       tamil      84.5
B      maths      74.5
       tamil      75.0
C      science    64.0
Name: Test Score, dtype: float64